use mermaid diagraming instead
